01_cylinderSHM/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-5 -5 -2)
    (5 -5 -2)
    (-5 5 -2)
    (5 5 -2)
    (-5 -5 8)
    (5 -5 8)
    (-5 5 8)
    (5 5 8)
    (-5 -4 0)
    (15 -4 0)

);

blocks
(
    hex (0 1 3 2 4 5 7 6) (20 20 20) simpleGrading (1 1 1)
);

edges
(
);

boundary
(

);

// ************************************************************************* //
